snlkuharlocal/src/Documents/ПеремещениеМатериаловИТары/ПеремещениеМатериаловИТары.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПеремещениеМатериаловИТары</name>
  <basedOn>Document.РасходМатериаловИТары</basedOn>
  <basedOn>Document.ПеремещениеМатериаловИТары</basedOn>
  <basedOn>Document.ПриходМатериаловИТары</basedOn>
  <registerRecords>AccumulationRegister.ТарныеОстатки</registerRecords>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>КодОперацииОстатки</name>
    <type>
      <types>EnumRef.КодыОперацийОстатки</types>
    </type>
  </attributes>
  <attributes>
    <name>СостояниеНакладной</name>
    <type>
      <types>EnumRef.СостоянияНакладной</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>СкладПолучатель</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СостояниеНакладнойУПолучателя</name>
    <type>
      <types>EnumRef.СостоянияНакладной</types>
    </type>
  </attributes>
  <attributes>
    <name>ПунктДоставки</name>
    <type>
      <types>CatalogRef.ПунктыДоставки</types>
    </type>
  </attributes>
  <attributes>
    <name>НеСоответствуетЗаявке</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Принято</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Единица</name>
      <type>
        <types>CatalogRef.Единицы</types>
      </type>
    </attributes>
    <attributes>
      <name>Коэффициент</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЦенаОприходования</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>19</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Объем</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>7</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтавкаНДС</name>
      <type>
        <types>EnumRef.СтавкиНДС</types>
      </type>
    </attributes>
    <attributes>
      <name>НДС</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>19</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Всего</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>19</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

snlkuharlocal/src/AccumulationRegisters/ТарныеОстатки/ТарныеОстатки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ТарныеОстатки</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>КодОперации</name>
    <type>
      <types>EnumRef.КодыОперацийОстатки</types>
    </type>
  </attributes>
  <attributes>
    <name>ПунктДоставки</name>
    <type>
      <types>CatalogRef.ПунктыДоставки</types>
    </type>
  </attributes>
  <dimensions>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

snlkuharlocal/src/Documents/ПеремещениеМатериаловИТары/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим) экспорт
	//++Ратманов управляемые блокировки
	Если НЕ ПроведениеС.БлокировкаПоОбъекту(Ссылка) Тогда  
		Отказ = Истина;
		Возврат;
	КонецЕсли;	
	Если НЕ ПроведениеС.КонтрольПоОбъекту(Ссылка) Тогда  
		Отказ = Истина;
		Возврат;
	КонецЕсли;	
	//--Ратманов управляемые блокировки
	
	получатель=Ложь;
	отправитель=Ложь;
	ЦО=Ложь;
	
	если склад.КодФизическогоУзла=ПараметрыСеанса.ЭтотУзел.Код тогда
		получатель=Ложь;
		отправитель=Истина;
	ИначеЕсли СкладПолучатель.КодФизическогоУзла=ПараметрыСеанса.ЭтотУзел.Код тогда
		получатель=Истина;
		отправитель=Ложь;
	ИначеЕсли ПараметрыСеанса.ЭтотУзел.ТипУзла=Перечисления.ТипУзлаИБ.УправляющееПодразделение тогда 
		ЦО=Истина;
	КонецЕсли;
	
	если СостояниеНакладной=Перечисления.СостоянияНакладной.Отгружена и (отправитель или ЦО) тогда
		Для Каждого ТекСтрокаТовары Из Товары Цикл
			// регистр ТарныеОстатки Расход
			Движение = Движения.ТарныеОстатки.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
			Движение.Период = Дата;
			Движение.Склад = Склад;
			Движение.Номенклатура = ТекСтрокаТовары.Номенклатура;
			Движение.Количество = ТекСтрокаТовары.Количество;
			Движение.Сумма = ТекСтрокаТовары.Сумма;
			Движение.КодОперации = КодОперацииОстатки;
			Движение.ПунктДоставки = ПолучитьПДСклада(СкладПолучатель);
		КонецЦикла;
	КонецЕсли;
	
	если СостояниеНакладнойУПолучателя=Перечисления.СостоянияНакладной.Принята и (получатель или ЦО) тогда
		Для Каждого ТекСтрокаТовары Из Товары Цикл
			// регистр ТарныеОстатки Приход
			Движение = Движения.ТарныеОстатки.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
			Движение.Период = Дата;
			Движение.Склад = СкладПолучатель;
			Движение.Номенклатура = ТекСтрокаТовары.Номенклатура;
			Движение.Количество = ТекСтрокаТовары.Принято;
			Движение.Сумма = ТекСтрокаТовары.Принято*ТекСтрокаТовары.Цена;
			Движение.КодОперации = КодОперацииОстатки;
			Движение.ПунктДоставки = ПолучитьПДСклада(Склад);
		КонецЦикла;
		//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	КонецЕсли;
	Если ОбменДанными.Загрузка тогда
		Движения.ТарныеОстатки.Записать();
	КонецЕсли;
	
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(Основание)
	//{{__КОНСТРУКТОР_ВВОД_НА_ОСНОВАНИИ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	Если ТипЗнч(Основание) = Тип("ДокументСсылка.РасходМатериаловИТары") Тогда
		// Заполнение шапки
		Автор = Основание.Автор;
		КодОперацииОстатки = Основание.КодОперацииОстатки;
		Комментарий = Основание.Комментарий;
		Контрагент = Основание.Контрагент;
		Организация = Основание.Организация;
		ПунктДоставки = Основание.ПунктДоставки;
		Склад = Основание.Склад;
		СостояниеНакладной = Основание.СостояниеНакладной;
		Для Каждого ТекСтрокаТовары Из Основание.Товары Цикл
			НоваяСтрока = Товары.Добавить();
			НоваяСтрока.Всего = ТекСтрокаТовары.Всего;
			НоваяСтрока.Единица = ТекСтрокаТовары.Единица;
			НоваяСтрока.Количество = ТекСтрокаТовары.Количество;
			НоваяСтрока.Коэффициент = ТекСтрокаТовары.Коэффициент;
			НоваяСтрока.НДС = ТекСтрокаТовары.НДС;
			НоваяСтрока.Номенклатура = ТекСтрокаТовары.Номенклатура;
			НоваяСтрока.Объем = ТекСтрокаТовары.Объем;
			НоваяСтрока.СтавкаНДС = ТекСтрокаТовары.СтавкаНДС;
			НоваяСтрока.Сумма = ТекСтрокаТовары.Сумма;
			НоваяСтрока.Цена = ТекСтрокаТовары.Цена;
			НоваяСтрока.ЦенаОприходования = ТекСтрокаТовары.ЦенаОприходования;
		КонецЦикла;
	ИначеЕсли ТипЗнч(Основание) = Тип("ДокументСсылка.ПриходМатериаловИТары") Тогда
		// Заполнение шапки
		Автор = Основание.Автор;
		КодОперацииОстатки = Основание.КодОперацииОстатки;
		Комментарий = Основание.Комментарий;
		Контрагент = Основание.Контрагент;
		Организация = Основание.Организация;
		ПунктДоставки = Основание.ПунктДоставки;
		Склад = Основание.Склад;
		СостояниеНакладной = Основание.СостояниеНакладной;
		Для Каждого ТекСтрокаТовары Из Основание.Товары Цикл
			НоваяСтрока = Товары.Добавить();
			НоваяСтрока.Всего = ТекСтрокаТовары.Всего;
			НоваяСтрока.Единица = ТекСтрокаТовары.Единица;
			НоваяСтрока.Количество = ТекСтрокаТовары.Количество;
			НоваяСтрока.Коэффициент = ТекСтрокаТовары.Коэффициент;
			НоваяСтрока.НДС = ТекСтрокаТовары.НДС;
			НоваяСтрока.Номенклатура = ТекСтрокаТовары.Номенклатура;
			НоваяСтрока.Объем = ТекСтрокаТовары.Объем;
			НоваяСтрока.СтавкаНДС = ТекСтрокаТовары.СтавкаНДС;
			НоваяСтрока.Сумма = ТекСтрокаТовары.Сумма;
			НоваяСтрока.Цена = ТекСтрокаТовары.Цена;
			НоваяСтрока.ЦенаОприходования = ТекСтрокаТовары.ЦенаОприходования;
		КонецЦикла;
	КонецЕсли;
	//}}__КОНСТРУКТОР_ВВОД_НА_ОСНОВАНИИ
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	НадоВыгружать = Ложь;
		
	ЕстьИзменения	=Модифицированность();	
	НадоВыгружать	=НужноВыгружатьДокумент(ЕстьИзменения,Ссылка,РежимЗаписи,ПометкаУдаления);
	
 	Если не ОбменДанными.Загрузка Тогда
        НадоВыгружать = Истина;
	КонецЕсли;
	
	
	Если НадоВыгружать Тогда
		УстановитьПолучателейИзмененийОбъекта(ЭтотОбъект);
	КонецЕсли;
	
КонецПроцедуры


Функция ПолучитьПДСклада(СкладРеквизит) Экспорт 
	запрос=новый запрос;
	запрос.Текст="ВЫБРАТЬ ПЕРВЫЕ 1
	|	ПунктыДоставки.Ссылка как ПД
	|ИЗ
	|	Справочник.ПунктыДоставки КАК ПунктыДоставки
	|ГДЕ
	|	ПунктыДоставки.Владелец = &Владелец
	|	И ПунктыДоставки.ПометкаУдаления = ложь";
	запрос.УстановитьПараметр("Владелец",СкладРеквизит);			 
	результат=запрос.Выполнить().Выгрузить();
	
	если результат.Количество()>0 тогда
		Возврат результат.Получить(0).ПД;
	иначе
		Возврат Справочники.ПунктыДоставки.ПустаяСсылка();
	КонецЕсли;
	
	
	
КонецФункции
